# Реализовать проект расчета суммарного расхода ткани на производство одежды.
# Основная сущность (класс) этого проекта — одежда, которая может иметь определенное название.
# К типам одежды в этом проекте относятся пальто и костюм.
# У этих типов одежды существуют параметры: размер (для пальто) и рост (для костюма).
# Это могут быть обычные числа: V и H, соответственно.

from abc import ABC, abstractmethod

class Clothes(ABC):
    def __init__(self, param):
        self.param = param

    @abstractmethod
    def calculate(self):
        pass

class Coat(Clothes):
    @property
    def calculate(self):
        return round((self.param / 6.5) + 0.5)

class Suit(Clothes):
    @property
    def calculate(self):
        return round((2 * self.param) + 0.3)


coat = Coat(30)
suit = Suit(210)
print(coat.calculate, suit.calculate)